In [29]:
import pandas as pd
import numpy as np

In [30]:
string_data = pd.Series(['aarvark', 'artichoke', np.nan, 'avocado'])
string_data

0      aarvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [31]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [32]:
from numpy import nan as NA

In [33]:
data = pd.DataFrame([[1, 6.5, 3.], [1, NA, NA], [NA, NA, NA], [NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [34]:
cleaned = data.dropna()
cleaned

     0    1    2
0  1.0  6.5  3.0

In [35]:
cleaned = data.dropna(how='all')
cleaned

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [36]:
cleaned = data.dropna(axis=1, how='all')
cleaned

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [37]:
data = pd.DataFrame({'k1':['one', 'two'] * 3 + ['two'],
                     'k2':[1,1,2,3,3,4,4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [38]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [39]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4